function Qua = NormlzQua(Qua0)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function：四元数归一化
%
% Prototype: Qua = NormlzQua(Qua0)
% Inputs: Qua0 - 未归一化的姿态四元数
% Output: Qua - 归一化后的四元数
%
% By Taoran Zhao
% 2023/03/29 2023/05/18
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% ---------------一、统一四元数旋转方向---------------
% q0为正
if Qua0(1) < 0
    Qua0 = -Qua0;
end
%% ---------------二、归一化---------------
QQ = Qua0'*Qua0;
q0 = Qua0(1)/sqrt(QQ);
q1 = Qua0(2)/sqrt(QQ);
q2 = Qua0(3)/sqrt(QQ);
q3 = Qua0(4)/sqrt(QQ);
Qua = [q0; q1; q2; q3];      % 归一化    
