%求系数：对称阵对应系数
A3=zeros(3,3);
b2=zeros(3,1);
%直接求inv(k)各个元素
A3(1,1)=sqrt(a1);
A3(2,2)=sqrt(a2);
A3(3,3)=sqrt(a3);
A3(1,2)=0.5*a4/(A3(1,1)+A3(2,2));
A3(1,3)=0.5*a5/(A3(1,1)+A3(3,3));
A3(2,3)=0.5*a6/(A3(2,2)+A3(3,3));
A3(2,1)=A3(1,2);
A3(3,1)=A3(1,3);
A3(3,2)=A3(2,3);
b2(1,1)=-0.5*a7/(A3(1,1)*A3(1,1));
b2(2,1)=-0.5*a8/(A3(2,2)*A3(2,2));
b2(3,1)=-0.5*a9/(A3(3,3)*A3(3,3));
A3_1=inv(A3);
M=A3*[datax(1,:)-b2(1); datay(1,:)-b2(2); dataz(1,:)-b2(3)];
datax_a=M(1,:);
datay_a=M(2,:);
dataz_a=M(3,:);
plot3(datax_a,datay_a,dataz_a,'bo','MarkerSize',1);
grid on;
axis equal;