function Rn = QuaMulV(Qnb, Rb)  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function：四元数乘矢量，即三维矢量的四元数坐标变换
%
% Prototype: vo = QuaMulV(Qua, v) 
% Inputs: Qnb - 姿态四元数
%         v - 三维矢量
% Output: vo - 输出的三维矢量
%
% By Taoran Zhao
% 2023/04/29 2023/05/18
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% ---------------一、统一四元数旋转方向---------------
% 规定q0为正
if Qnb(1) < 0
    Qnb = -Qnb;
end
%% ---------------二、四元数乘矢量---------------
% 见《惯性导航 (第三版) (秦永元 编著)》P259
q0 = Qnb(1);q1 = Qnb(2);q2 = Qnb(3);q3 = Qnb(4);
Cnb = [q0^2 + q1^2 - q2^2 - q3^2,       2*(q1*q2 - q0*q3),                  2*(q1*q3 + q0*q2);
       2*(q1*q2 + q0*q3),               q0^2 - q1^2 + q2^2 - q3^2,          2*(q2*q3 - q0*q1);
       2*(q1*q3 - q0*q2),               2*(q2*q3 + q0*q1),                  q0^2 - q1^2 - q2^2 + q3^2];
Rn = Cnb*Rb;