function PQ = QuaMulQua(P, Q)  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function：四元数相乘
%
% Prototype: PQ = QuaMulQua(P, Q)
% Inputs: P - 四元数
%         Q - 四元数
% Output: PQ - 四元数相乘后的新四元数 Qmn⊗Qbm = Qbn
% 
% By Taoran Zhao
% 2023/04/29 2023/05/18
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% ---------------一、统一四元数旋转方向---------------
% 规定q0为正
if P(1) < 0
    P = -P;
end
if Q(1) < 0
    Q = -Q;
end
%% ---------------二、四元数相乘---------------
% 见《惯性导航 (第三版) (秦永元 编著)》P254
p0 = P(1);p1 = P(2);p2 = P(3);p3 = P(4);
q0 = Q(1);q1 = Q(2);q2 = Q(3);q3 = Q(4);   
PQ = [ p0*q0 - p1*q1 - p2*q2 - p3*q3;
       p0*q1 + p1*q0 + p2*q3 - p3*q2;
       p0*q2 + p2*q0 + p3*q1 - p1*q3;
       p0*q3 + p3*q0 + p1*q2 - p2*q1  ]; 
   
