function Cnb = Qnb2Cnb(Qnb)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function：姿态四元数转姿态矩阵
%
% Prototype: Cnb = Qnb2Cnb(Qnb)
% Inputs: Qnb - 姿态四元数
% Output: Cnb - 姿态矩阵
%
% By Taoran Zhao
% 2023/03/29
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    q0 = Qnb(1);
    q1 = Qnb(2);
    q2 = Qnb(3);
    q3 = Qnb(4);
    Cnb = [ q0^2 + q1^2 - q2^2 - q3^2,   2*(q1*q2 - q0*q3),           2*(q1*q3 + q0*q2);
            2*(q1*q2 + q0*q3),            q0^2 - q1^2 + q2^2 - q3^2,   2*(q2*q3 - q0*q1); 
            2*(q1*q3 - q0*q2),            2*(q2*q3 + q0*q1),           q0^2 - q1^2 - q2^2 + q3^2   ];
